


'''

< 무지의 먹방 라이브 >

회전판에 먹어야 할 N개의 음식이 있다.
각 음식에는 1부터 N까지 번호가 붙어있다.
각 음식을 섭취하는데 일정시간이 소요된다.
1. 1번음식부터 먹기 시작하며
회전판은 번호가 증가하는 순서대로 음식을 앞으로 가져다 놓는다.
2. 마지막 번호의 음식을 먹은 후 회전판에 의해 다시 1번 음식이 앞으로 온다.
3. 음식 1개를 1초동안 섭취한 후에 남은 음식은 그대로 두고 다음 음식을 섭취한다.
다음 음식이란 아직 남은 음식 중 다음으로 섭취해야할 가장 가까운 번호의 음식을 말한다.
4. 회전판이 다음 음식을 앞으로 가져오는데 걸리는 시간은 없다고 가정한다.

무지가 먹방을 시작한지 k초 후에  장애로 방송이 잠시 중단되었다.
몇번 음식부터 섭취해야하는지 알고자한다.

음식을 모두 먹는데 필요한 시간이 담겨있는 배열과 k초가 매개변수로 입력되면
몇 번 음식부터 다시 먹어야하는지를 반환하는 함수를 만들어라




아이디어 :






설계:



피드백 :




'''



